#  Basic use of pandas

In [1]:
import pandas as pd

In [2]:
# dataframe
df1 = pd.DataFrame([[12,34,45,67],[2,4,5,6]])

In [3]:
# to create data
df1

    0   1   2   3
0  12  34  45  67
1   2   4   5   6

In [4]:
# to set columns name
df1 = pd.DataFrame([[1,2,3,4],[12,24,36,48]],columns=["One","Two","Three","Four"])

In [5]:
df1

   One  Two  Three  Four
0    1    2      3     4
1   12   24     36    48

In [6]:
# to set row name we use - index 

df1 = pd.DataFrame([[1,2,3,4],[12,24,36,48]],
                   columns=["One","Two","Three","Four"],index=["Number","Tabel"])

In [7]:
df1

        One  Two  Three  Four
Number    1    2      3     4
Tabel    12   24     36    48

In [8]:
# another way to create dataframe
df2 = pd.DataFrame([{"Name":"sachin","Surname":"Kumar"},{"Name":"Amit","Surname":"mavi"}])
df2

     Name Surname
0  sachin   Kumar
1    Amit    mavi

In [9]:
type(df1)

pandas.core.frame.DataFrame

In [10]:
#dir(df1) to check the availabel method for it

In [11]:
df1

        One  Two  Three  Four
Number    1    2      3     4
Tabel    12   24     36    48

In [12]:
# here we done data analysis

df1.mean()

One       6.5
Two      13.0
Three    19.5
Four     26.0
dtype: float64

In [13]:
type(df1.mean())

pandas.core.series.Series

In [14]:
# the dataframe is create by series and the series is column

type(df1.Two)

pandas.core.series.Series

In [15]:
df1.mean().mean()

16.25

In [16]:
# to find mean of any one column
df1.Two.mean()

13.0

In [17]:
df1.Three.max()

36

## use data of csv file

In [18]:
df = pd.read_csv("E:\\software install\\Udemy - The Python Mega Course Build 10 Real World Applications\\6. Data Analysis with Pandas\\6.1 supermarkets.csv")
#df

In [19]:
df.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [20]:
from bs4 import BeautifulSoup
import requests

print(1)

1

In [21]:
r = requests.get("https://en.wikipedia.org/wiki/Chanakya")
#print(r.content)

# Read  data  in different format
- in pandas

In [22]:
csv_r = pd.read_csv("data in different format/6.1 supermarkets.csv")
# to remove header we use - header = None
csv_r

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [23]:
# to set id as index column use
csv_r.set_index(["ID"])

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [24]:
# to find shape
csv_r.shape
# first parameter is row and second is column

(6, 7)

In [25]:
## read josn using pandas
json_r = pd.read_json("data in different format/6.4 supermarkets.json.json")

In [26]:
# to see json data
json_r

,Address,City,Country,Employees,ID,Name,State
0,3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
1,735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
2,332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3,3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
4,1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
5,551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [27]:
json_r.set_index(["ID"])

,Address,City,Country,Employees,Name,State
ID,,,,,,
1,3666 21st St,San Francisco,USA,8,Madeira,CA 94114
2,735 Dolores St,San Francisco,USA,15,Bready Shop,CA 94119
3,332 Hill St,San Francisco,USA,25,Super River,California 94114
4,3995 23rd St,San Francisco,USA,10,Ben's Shop,CA 94114
5,1056 Sanchez St,San Francisco,USA,12,Sanchez,California
6,551 Alvarado St,San Francisco,USA,20,Richvalley,CA 94114

In [28]:
# read excel file .xls
# here we give to parameter 1 path 2 sheetname= 0 (or number og sheet)

excel_r = pd.read_excel("data in different format\\6.5 supermarkets.xlsx.xlsx",sheet_name=0)
excel_r

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [29]:
excel_r.set_index(["ID"])

,Address,City,State,Country,Supermarket Name,Number of Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

#  Indexing and slicing

In [30]:
df  = pd.read_csv("D:\\machine learing ducat\\Data science\\data in different format\\6.1 supermarkets.csv")
df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [44]:
#df
# label indexing threr are two type of indexing 1} label 2} positioning
df.loc[:3,"Name"]

0        Madeira
1    Bready Shop
2    Super River
3     Ben's Shop
Name: Name, dtype: object

## Index base slicing using iloc
-  iloc is used for index slicing

In [32]:
df1 = df.set_index(["City"])
df1

,ID,Address,State,Country,Name,Employees
City,,,,,,
San Francisco,1,3666 21st St,CA 94114,USA,Madeira,8
San Francisco,2,735 Dolores St,CA 94119,USA,Bready Shop,15
San Francisco,3,332 Hill St,California 94114,USA,Super River,25
San Francisco,4,3995 23rd St,CA 94114,USA,Ben's Shop,10
San Francisco,5,1056 Sanchez St,California,USA,Sanchez,12
San Francisco,6,551 Alvarado St,CA 94114,USA,Richvalley,20

In [33]:
df1.iloc[2:5,:3]

               ID          Address             State
City
San Francisco   3      332 Hill St  California 94114
San Francisco   4     3995 23rd St          CA 94114
San Francisco   5  1056 Sanchez St        California

#  combine using index
- ix is used to combine label and index

In [34]:
df1.ix[4,"Name"]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'Sanchez'